# VisGraphicsWorksets Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..VisGraphicsWorksets Property
ParameterTypeId Class See Also
---
"V/G Overrides Worksets"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId VisGraphicsWorksets { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VisGraphicsWorksets As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ VisGraphicsWorksets {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace